/* AND-test for flags sub tests with 1: subtest, 2: one or more sub tests */
"%@ and %@" = "%1$@ and %2$@";

/* Case-sensitive string test with 1: subject, and 2: match targets */
"%@ conTains %@" = "%1$@ conTains %2$@";

/* String test with 1: subject, and 2: match targets */
"%@ contains %@" = "%1$@ contains %2$@";

/* String test with 1: subject, and 2: match targets */
"%@ ends with %@" = "%1$@ ends with %2$@";

/* Case-sensitive string test with 1: subject, and 2: match targets */
"%@ enDs with %@" = "%1$@ enDs with %2$@";

/* String test with 1: subject, and 2: match targets */
"%@ equals %@" = "%1$@ equals %2$@";

/* Case-sensitive string test with 1: subject, and 2: match targets */
"%@ eQuals %@" = "%1$@ eQuals %2$@";

/* Pair of match targets with 1: a target match, and 2: another target match */
"%@ or %@" = "%1$@ or %2$@";

/* Case-sensitive string test with 1: subject, and 2: match targets */
"%@ starTs with %@" = "%1$@ starTs with %2$@";

/* String test with 1: subject, and 2: match targets */
"%@ starts with %@" = "%1$@ starts with %2$@";

/* Three or more match targets with 1: a target match, and 2: two or more other target matches */
"%@, %@" = "%1$@, %2$@";

/* AND-test with 1: sub test, and 2: two or more other sub tests */
"(%@) and %@" = "(%1$@) and %2$@";

/* AND-test with 1: sub test, and 2: another sub test */
"(%@) and (%@)" = "(%1$@) and (%2$@)";

/* OR-test with 1: sub test, and 2: two or more other sub tests */
"(%@) or %@" = "(%1$@) or %2$@";

/* OR-test with 1: sub test, and 2: another sub test */
"(%@) or (%@)" = "(%1$@) or (%2$@)";

/* Selective test with 1: sub test */
"files: %@" = "files: %@";

/* Selective test with 1: sub test */
"folders: %@" = "folders: %@";

/* Size test without any bounds */
"any size" = "any size";

/* File/folder flags sub test */
"item is a package" = "item is a package";

/* File/folder flags sub test */
"item is hard-linked" = "item is hard-linked";

/* File/folder flags sub test */
"item is not a package" = "item is not a package";

/* File/folder flags sub test */
"item is not hard-linked" = "item is not hard-linked";

/* A filename as the subject of a string test */
"name" = "name";

/* NOT-test with 1: sub test */
"not (%@)" = "not (%@)";

/* A pathname as the subject of a string test */
"path" = "path";

/* Size test with 1: lower bound, and 2: upper bound */
"size is between %@ and %@" = "size is between %1$@ and %2$@";

/* Size test with 1: lower bound */
"size is larger than %@" = "size is larger than %@";

/* Size test with 1: upper bound */
"size is smaller than %@" = "size is smaller than %@";

/* Filetype test with 1: match targets */
"type conforms to %@" = "type conforms to %@";

/* Filetype test with 1: match targets */
"type equals %@" = "type equals %@";

